EDT/УТ/src/Reports/ОтчетПоСпискуЗаказов/ОтчетПоСпискуЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоСпискуЗаказов</name>
</mdclass:Report>

EDT/УТ/src/Documents/Накладная003/Накладная003.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Накладная003</name>
  <registerRecords>InformationRegister.ОткорректированныеЗаказы003ПоНакладным</registerRecords>
  <registerRecords>InformationRegister.ДоставкиКУдалению003</registerRecords>
  <registerRecords>InformationRegister.ДатыДоставок</registerRecords>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтработанногоДня</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалПриема</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.Фрахт</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийНомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НенайденныеЗаказы</name>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийНомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Reports/ОтчетПоСпискуЗаказов/ObjectModule.bsl
Процедура Сформировать(Т, СписокНомеров) Экспорт
	Т.Очистить();
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ЗакрытиеЗаказовЗаказы.ВнешнийНомер КАК ВнешнийНомер,
	            |	Накладная003Заказы.Вес,
	            |	ЗакрытиеЗаказовЗаказы.КомментарийСД,
	            |	НЕ ЗакрытиеЗаказовЗаказы.Доставка.ТочкаПрибытия.Москва КАК ЗаМкад,
	            |	ЗакрытиеЗаказовЗаказы.Показатель1 КАК УслугиСД,
	            |	ЗакрытиеЗаказовЗаказы.Показатель2 КАК Подъём
	            |ИЗ
	            |	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	            |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Накладная003.Заказы КАК Накладная003Заказы
	            |		ПО ЗакрытиеЗаказовЗаказы.Реализация.Ссылка = Накладная003Заказы.Заказ.Ссылка
	            |ГДЕ
	            |	(ПОДСТРОКА(ЗакрытиеЗаказовЗаказы.ВнешнийНомер, 6, 8) В (&МасНомеров)
	            |			ИЛИ ЗакрытиеЗаказовЗаказы.ВнешнийНомер В (&МасНомеров))
	            |	И ЗакрытиеЗаказовЗаказы.Ссылка.Проведен = ИСТИНА
	            |	И (ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА
	            |			ИЛИ ЗакрытиеЗаказовЗаказы.Отклонить = ИСТИНА)
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ВнешнийНомер";
				
	Зап.УстановитьПараметр("МасНомеров", СписокНомеров);			
	Рез = Зап.Выполнить().Выгрузить();
	
	
	Мак = ПолучитьМакет("Макет");
	Обл = Мак.ПолучитьОбласть("Строка");
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	
	Т.Вывести(ОблШ);
	
	НПП = 1;
	Для Каждого Тек Из СписокНомеров Цикл
		СтрукНом = Новый Структура;
		СтрукНом.Вставить("ВнешнийНомер", Тек);
		
		НайСтроки = Рез.НайтиСтроки(СтрукНом);
		
		Для СчСтр = 0 По НайСтроки.Количество() - 1 Цикл
			Обл.Параметры.НПП = НПП;
			Обл.Параметры.Номер = Тек;
			Най = НайСТроки[СчСтр];
			Если Най <> Неопределено Тогда
				Обл.Параметры.ЕстьВСистеме = истина;
				Обл.Параметры.Вес = Най.Вес;
				Обл.Параметры.КомментарийСД = Най.КомментарийСД;
				Обл.Параметры.ЗаМкад = Най.ЗаМкад;
				Обл.Параметры.УслугиСД = Най.УслугиСД;
				Обл.Параметры.подъём = Най.подъём;
			Иначе
				Обл.Параметры.ЕстьВСистеме = Ложь;
				Обл.Параметры.Вес = 0;
				Обл.Параметры.КомментарийСД = "";
				Обл.Параметры.ЗаМкад = Ложь;
				Обл.Параметры.УслугиСД = 0;
				Обл.Параметры.подъём = 0;
			КонецеСли;	
			НПП = НПП + 1;
			т.Вывести(Обл);
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры
